
export default{
	//所在站点
	//用户基本信息
	//用户角色
	//用户导航
	//用户头像
	//用户
	
	/**
	 * 用户在登录前还需要获取系统的基本设置信息
	 * 是否允许第三方登录，第三方登录的接口地址等
	 * 
	 * 如果系统存储没有完善还需要拿到存储的设置
	 * 
	 * */
	
	// 用户本地登录
	// 用户验证码
	// 用户二维码授权登录
	// 用户第三方登录（微信，QQ，新浪）
	// 用户单点登录
	// 退出登录
	
	//用户注册
	//用户找回密码（手机找回）（邮箱找回）
	//用户协议
	
	//用户消息（系统消息，站内通讯）
	
	// 用户基本信息框架（系统修改或新增用户的基本资料）
	// 用户的基本信息修改
	// 用户手机修改
	// 用户邮箱修改
	// 用户密码修改
	// 用户基本信息计分
	// 用户实用认证
	
	//用户登录记录
	//用户访问记录
	
	// 机构用户
	// 完善机构基本信息
	// 完善机构组织结构、职务 及关联的成员
	// 完机构角色及权限
	
	// 机构通讯录
	// 机构成员通讯记录
	
	//党员管理应用
	// 党员管理（申请/注册/邀请到本机构）
	// 党员管理流程设置
	// 党员行为记录
	// 党员统计
}